In [81]:
import pandas as pd
sales=pd.read_excel('1 Sales Data.xlsx')
sales

,Invoice Number,Date,Time,Zone,Manager,Customer,Product,price,Units Sold,sales
0,102234,2010-01-07,10:25:37.200000,East,Bruce,Polo,A001,485,42,20370
1,102235,2010-01-07,12:00:00,East,Jacob,EEE,B227,292,71,20732
2,102235,2010-01-07,14:19:12,East,Melvin,Marco,A009,544,87,47328
3,102236,2010-01-07,12:57:00,South,Alicia,EEE,D440,385,51,19635
4,102236,2010-01-07,14:51:36,East,Paul,Zee,WP6,173,69,11937
...,...,...,...,...,...,...,...,...,...,...
26078,115273,2018-12-10,11:16:48,West,Melvin,ABC,B229,388,202,78376
26079,115274,2018-12-10,11:16:48,West,Melvin,ABC,B229,388,201,77988
26080,115273,2019-12-10,11:16:48,West,Melvin,ABC,B229,388,500,194000
26081,115273,2019-12-10,11:16:48,West,Melvin,ABC,B229,388,1000,388000
26082,115274,2019-12-10,11:16:48,West,Melvin,ABC,B229,388,1500,582000

In [82]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26083 entries, 0 to 26082
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Invoice Number  26083 non-null  int64
 1   Date            26083 non-null  datetime64[ns]
 2   Time            26083 non-null  object
 3   Zone            26083 non-null  object
 4   Manager         26083 non-null  object
 5   Customer        26083 non-null  object
 6   Product         26083 non-null  object
 7   price           26083 non-null  int64
 8   Units Sold      26083 non-null  int64
 9   sales           26083 non-null  int64
dtypes: datetime64[ns](1), int64(4), object(5)
memory usage: 2.0+ MB

In [83]:
sales.head()

,Invoice Number,Date,Time,Zone,Manager,Customer,Product,price,Units Sold,sales
0,102234,2010-01-07,10:25:37.200000,East,Bruce,Polo,A001,485,42,20370
1,102235,2010-01-07,12:00:00,East,Jacob,EEE,B227,292,71,20732
2,102235,2010-01-07,14:19:12,East,Melvin,Marco,A009,544,87,47328
3,102236,2010-01-07,12:57:00,South,Alicia,EEE,D440,385,51,19635
4,102236,2010-01-07,14:51:36,East,Paul,Zee,WP6,173,69,11937

# Find total sales

In [84]:
sales.sum()

C:\Users\athir\AppData\Local\Temp\ipykernel_4688\702967242.py:1: FutureWarning: The default value of numeric_only in DataFrame.sum is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  sales.sum()

Invoice Number                                           2836650140
Zone              EastEastEastSouthEastEastEastEastSouthEastEast...
Manager           BruceJacobMelvinAliciaPaulBruceJacobMelvinAlic...
Customer          PoloEEEMarcoEEEZeePoloEEEMarcoEEEZeePoloEEEMar...
Product           A001B227A009D440WP6A001B227A009D440WP6A001B227...
price                                                       9562092
Units Sold                                                  2961642
sales                                                    1085806200
dtype: object

# Find total number of products sold.

In [85]:
a=sales['Product '].value_counts().sum()
a

26083

# Find maximum Sales

In [86]:
a=sales['sales'].max()
a

582000

# Find Minimum Sales

In [87]:
a=sales['sales'].min()
a

865

# Find the Average Sales

In [88]:
a=sales['sales'].mean()
a

41628.88471418165

# Find the Range of Sales

In [89]:
a=582000-865
a

581135

# Find the Standard Deviation of Sales

In [ ]:
import statisties

In [97]:
#standard deviation of sales
X=[26083,865,41628.88471418165,581135]

#uuing numpy
np=stdev.s(X)

NameError: name 'stdev' is not defined